NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
/** Completed SAR session, used to cache previous sessions. */
typedef struct
{
    bool successful;
    uint8_t ivi;
    uint16_t src;
    uint32_t seqauth_seqnum;
} completed_sar_session_t;

/** A consumer of control packets. */
typedef struct
{
    const transport_control_packet_handler_t * p_handlers; /**< List of opcodes and their handler functions. */
    uint32_t handler_count; /**< Number of handlers. */
} control_packet_consumer_t;
/********************
 * Static variables *
 ********************/

static transport_config_t m_trs_config;
static trs_sar_ctx_t m_trs_sar_sessions[TRANSPORT_SAR_SESSIONS_MAX];
#if MESH_FEATURE_LPN_ENABLED
static uint8_t m_trs_sar_lpn_buffer[NRF_MESH_UPPER_TRANSPORT_PDU_SIZE_MAX];
#endif
static uint32_t m_sar_session_cache_head;
static completed_sar_session_t m_sar_session_cache[TRANSPORT_SAR_RX_CACHE_LEN];

/** Flag used to trigger SAR processing. */
static bearer_event_flag_t m_sar_process_flag;

static control_packet_consumer_t m_control_packet_consumers[TRANSPORT_CONTROL_PACKET_CONSUMERS_MAX];
static uint32_t m_control_packet_consumer_count;
/********************
 * Static functions *
 ********************/

static void ack_timeout(timestamp_t timestamp, void * p_context);
static void retry_timeout(timestamp_t timestamp, void * p_context);
static void abort_timeout(timestamp_t timestamp, void * p_context);

#if MESH_FEATURE_LPN_ENABLED
static bool sar_payload_is_heap_allocated(trs_sar_ctx_t * p_sar_ctx)
{
    return ((intptr_t) p_sar_ctx->payload != (intptr_t) &m_trs_sar_lpn_buffer[0]);
}
#endif

static inline uint32_t block_ack_full(transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_metadata->segmented);
    return ((1u << (p_metadata->segmentation.last_segment + 1)) - 1);
}
static void upper_transport_packet_in(const uint8_t * p_upper_trs_packet,
                                      uint32_t upper_trs_packet_len,
                                      transport_packet_metadata_t * p_metadata,
                                      const nrf_mesh_rx_metadata_t * p_rx_metadata);

static uint32_t seqauth_sequence_number_get(uint32_t seqnum, uint16_t seqzero)
{
    if ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) < seqzero)
    {
        return ((seqnum - ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) - seqzero) - (TRANSPORT_SAR_SEQZERO_MASK + 1)));
    }
    else
    {
        return ((seqnum - ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) - seqzero)));
    }
}

static void m_send_replay_cache_full_event(uint16_t src, uint8_t ivi, nrf_mesh_rx_failed_reason_t reason)
{
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_RX_FAILED,
            .params.rx_failed.src = src,
            .params.rx_failed.ivi = ivi,
            .params.rx_failed.reason = reason
        };
    event_handle(&evt);
}

static void m_send_sar_cancel_event(nrf_mesh_tx_token_t token, nrf_mesh_sar_session_cancel_reason_t reason)
{
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_SAR_FAILED,
            .params.sar_failed.token = token,
            .params.sar_failed.reason = reason
        };
    event_handle(&evt);
}

static inline uint32_t rx_ack_timer_delay_get(uint8_t ttl)
{
    return m_trs_config.rx_ack_base_timeout + m_trs_config.rx_ack_per_hop_addition * ttl;
}

static inline uint32_t tx_retry_timer_delay_get(uint8_t ttl)
{
    return m_trs_config.tx_retry_base_timeout + m_trs_config.tx_retry_per_hop_addition * ttl;
}

/**
 * Check whether the RX SAR session has been handled before. As the sessions are stored in a FIFO
 * cache manner, getting a pointer to the completed session.
 *
 * @param[in] p_metadata Metadata to check for.
 *
 * @retval Pointer to the completed session from the cache if there is. NULL otherwise.
 */
static completed_sar_session_t * sar_rx_session_previously_handled(const transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_metadata->segmented);

    uint16_t src = p_metadata->net.src;
    uint8_t ivi = p_metadata->net.internal.iv_index & NETWORK_IVI_MASK;
    uint32_t seqauth_seqnum = seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                                          p_metadata->segmentation.seq_zero);

    for (uint32_t i = 0; i < TRANSPORT_SAR_RX_CACHE_LEN; ++i)
    {
        if (seqauth_seqnum == m_sar_session_cache[i].seqauth_seqnum &&
            src == m_sar_session_cache[i].src &&
            ivi == m_sar_session_cache[i].ivi)
        {
            return &m_sar_session_cache[i];
        }
    }
    return NULL;
}


/**
 * Places completed SAR session into the session cache.
 *
 * @param[in] p_metadata SAR metadata handled.
 * @param[in] succeeded  The session has been succeeded or not.
 */
static void sar_rx_session_mark_as_handled(const transport_packet_metadata_t * p_metadata, bool succeeded)
{
    NRF_MESH_ASSERT(p_metadata->segmented);

    completed_sar_session_t * p_completed_session = &m_sar_session_cache[m_sar_session_cache_head++ &
                                                                         TRANSPORT_SAR_RX_CACHE_LEN_MASK];

    p_completed_session->src = p_metadata->net.src;
    p_completed_session->seqauth_seqnum = seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                                                      p_metadata->segmentation.seq_zero);
    p_completed_session->ivi = p_metadata->net.internal.iv_index & NETWORK_IVI_MASK;
    p_completed_session->successful = succeeded;
}

/**
 * Allocate the given SAR context with the given parameters.
 *
 * @param[in] p_metadata Metadata to use in the context.
 * @param[in] session_type Type of session.
 * @param[in] length Length of SAR data, including MIC.
 *
 * @returns pointer to allocated context if successful. NULL otherwise.
 */
static trs_sar_ctx_t * sar_ctx_alloc(const transport_packet_metadata_t * p_metadata,
                                     trs_sar_session_t session_type,
                                     uint32_t length)
{
    NRF_MESH_ASSERT_DEBUG(session_type == TRS_SAR_SESSION_RX ||
                          session_type == TRS_SAR_SESSION_TX);
    NRF_MESH_ASSERT_DEBUG(length <= NRF_MESH_UPPER_TRANSPORT_PDU_SIZE_MAX);

    trs_sar_ctx_t * p_sar_ctx = NULL;
    uint32_t i = 0;
#if MESH_FEATURE_LPN_ENABLED
    /* Reserve one session for RX if LPN is enabled. */
    if (session_type == TRS_SAR_SESSION_TX)
    {
        i = 1;
    }
#endif
    for (; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_INACTIVE)
        {
            p_sar_ctx = &m_trs_sar_sessions[i];
#if MESH_FEATURE_LPN_ENABLED
            if (i == 0)
            {
                p_sar_ctx->payload = m_trs_sar_lpn_buffer;
            }
            else
#endif
            {
                p_sar_ctx->payload = mesh_mem_alloc(length);
            }
            break;
        }
    }

