NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
        status = transport_control_tx(&control_packet, NRF_MESH_SAR_TOKEN);

        if (status == NRF_SUCCESS)
        {
            __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_ACK_QUEUED, 0, PACKET_MESH_TRS_CONTROL_SEGACK_SIZE, &packet_buffer);
        }
    }
    return status;
}

static void sar_tx_session_end(trs_sar_ctx_t * p_sar_ctx)
{
    /* We're out of retries. Should give up. */
    if (p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_REASON_RETRY_OVER);
    }
    else
    {
        /* For non-unicast addresses, timing out is considered a successful way to end, as there
         * are no acknowledgments. */
        sar_ctx_tx_complete(p_sar_ctx);
    }
}

static void sar_tx_session_continue(trs_sar_ctx_t * p_sar_ctx)
{
    if (p_sar_ctx->session.params.tx.retries > 0)
    {
        p_sar_ctx->session.params.tx.retries--;
        p_sar_ctx->session.params.tx.start_index = 0;
        /* Set bearer flag to trigger sending of remaining segments. */
        bearer_event_flag_set(m_sar_process_flag);
    }
    else
    {
        sar_tx_session_end(p_sar_ctx);
    }
}

static trs_sar_ctx_t * sar_active_tx_ctx_get(transport_packet_metadata_t * p_metadata, uint16_t seq_zero)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX &&
            m_trs_sar_sessions[i].metadata.net.src == p_metadata->net.dst.value &&
            m_trs_sar_sessions[i].metadata.segmentation.seq_zero == seq_zero)
        {
            return &m_trs_sar_sessions[i];
        }
    }

    return NULL;
}

static trs_sar_ctx_t * sar_active_rx_ctx_get(transport_packet_metadata_t * p_metadata)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_RX &&
            m_trs_sar_sessions[i].metadata.net.src == p_metadata->net.src)
        {
            return &m_trs_sar_sessions[i];
        }
    }
    return NULL;
}


#if MESH_FEATURE_LPN_ENABLED
static void sar_rx_ctx_cancel_all(nrf_mesh_sar_session_cancel_reason_t reason)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_RX)
        {
            sar_ctx_cancel(&m_trs_sar_sessions[i], reason);
        }
    }
}

static void sar_tx_pending_retries_send(void)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX &&
            m_trs_sar_sessions[i].timeout_state == SAR_TIMEOUT_STATE_WAIT_POLL_COMPLETE)
        {
            sar_tx_session_continue(&m_trs_sar_sessions[i]);
        }
    }
}

static void mesh_evt_handler(const nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE:
            sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_REASON_LPN_RX_NOT_COMPLETE);
            sar_tx_pending_retries_send();
            break;

        case NRF_MESH_EVT_FRIENDSHIP_TERMINATED:
            sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_REASON_FRIENDSHIP_TERMINATED);
            /* TODO: If the DST is unicast and we're not scanning ~100%, we might want to cancel any
             * ongoing TX sessions (MBTLE-2825).  */
            sar_tx_pending_retries_send();
            break;

        case NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED:
            sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_REASON_FRIENDSHIP_ESTABLISHED);
            break;

        default:
            break;
    }
}
#endif  /* MESH_FEATURE_LPN_ENABLED */

static void trs_sar_seg_packet_in(const uint8_t * p_segment_payload,
                                  uint32_t segment_len,
                                  transport_packet_metadata_t * p_metadata,
                                  const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
#if MESH_FEATURE_LPN_ENABLED
    bool is_in_friendship = mesh_lpn_is_in_friendship();
#endif

    /* Find ongoing session by src. */
    trs_sar_ctx_t * p_sar_ctx = sar_active_rx_ctx_get(p_metadata);
    if (NULL != p_sar_ctx)
    {
        if (p_metadata->segmentation.seq_zero < p_sar_ctx->metadata.segmentation.seq_zero)
        {
#if MESH_FEATURE_LPN_ENABLED
            if (is_in_friendship)
            {
                /* The Friend node should only send us segments for complete transactions. However, if
                 * the Friend misbehaves, all we can do is ignore the segment. */
                __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_WARN,
                      "Invalid segment from Friend (seqzero: %d)\n", p_metadata->segmentation.seq_zero);
            }
#endif
            return;
        }

        if (p_metadata->segmentation.seq_zero > p_sar_ctx->metadata.segmentation.seq_zero)
        {
            sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_PEER_STARTED_ANOTHER_SESSION);
            p_sar_ctx = NULL;
        }
    }
#if MESH_FEATURE_LPN_ENABLED
    else if (is_in_friendship)
    {
        /* The Friend node should prevent the scenario where we're starting a new session whilst
         * still receiving another one, but we'll cancel anything ongoing to be sure. */
        sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_PEER_STARTED_ANOTHER_SESSION);
    }
    else
#endif
    {
        /* If we're not in a friendship, but we're receiving PDUs, we should behave as normal. In a
         * friendship, the Friend node should do all our acknowledgments for us. */

        /* Look for session in the cache */
        completed_sar_session_t * p_completed_session = sar_rx_session_previously_handled(p_metadata);
        if (NULL != p_completed_session)
        {
            if (p_completed_session->successful)
            {
                /* Already successfully processed this session. */
                (void) sar_ack_send(p_metadata, block_ack_full(p_metadata));
            }
            return;
        }
    }

    /* Create session */
    if (NULL == p_sar_ctx)
    {
        uint32_t total_length = ((p_metadata->segmentation.last_segment + 1) *
                                 TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet));
        if (total_length > TRANSPORT_SAR_PACKET_MAX_SIZE(p_metadata->net.control_packet))
        {
            __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_ERROR, "Invalid length: %u\n", total_length);
            return;
        }

        p_sar_ctx = sar_ctx_alloc(p_metadata, TRS_SAR_SESSION_RX, total_length);

        if (p_sar_ctx == NULL)
        {
#if MESH_FEATURE_LPN_ENABLED
            if (is_in_friendship)
            {
                /* We must assure that we always have room to receive a SAR message when in a
                 * friendship. */
                NRF_MESH_ASSERT_DEBUG(false);
            }
            else
#endif
            {
                /* Send block ack=0 to indicate failure to receive. Transport is out of resources. */
                (void) sar_ack_send(p_metadata, 0);
                m_send_sar_cancel_event(NRF_MESH_INITIAL_TOKEN, NRF_MESH_SAR_CANCEL_REASON_NO_MEM);
            }

            return;
        }
    }

    __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Got segment %u\n", p_metadata->segmentation.segment_offset);

#if MESH_FEATURE_LPN_ENABLED
    /* In a friendship, the Friend shall put segments in its Friend Queue when the message has been
     * fully received/assembled (ref. Mesh Profile v1.0, sec. 3.5.5). If we still have an active RX
     * context on NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE, we regard the session as failed. Thus no
     * need to start the incomplete timer. */
    if (!is_in_friendship)
#endif
    {
        /* Reset timers, even if we already received this segment. */
        rx_incomplete_timer_reset(p_sar_ctx);
    }
    if (p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST &&
        p_sar_ctx->session.params.rx.ack_state == SAR_ACK_STATE_IDLE
#if MESH_FEATURE_LPN_ENABLED
        && !is_in_friendship
#endif
        )
    {
        ack_timer_reset(p_sar_ctx);
    }

