NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (p_sar_ctx->session.block_ack & (1u << p_metadata->segmentation.segment_offset))
    {
        /* Segment already received. */
        return;
    }

    p_sar_ctx->session.block_ack |= (1u << p_metadata->segmentation.segment_offset);

    if (p_metadata->segmentation.segment_offset == p_sar_ctx->metadata.segmentation.last_segment)
    {
        /* Last segment might not be the full length of a normal segment, update total length */
        p_sar_ctx->session.length =
            segment_len + (p_sar_ctx->metadata.segmentation.last_segment *
                           TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet));
    }
    else if (segment_len != TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet))
    {
        /* Got a non-conformant segment length, discard the packet. */
        sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_REASON_INVALID_FORMAT);
        return;
    }

    memcpy(&p_sar_ctx->payload[p_metadata->segmentation.segment_offset *
                               TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet)],
           p_segment_payload,
           segment_len);

    if (p_sar_ctx->session.block_ack == block_ack_full(&p_sar_ctx->metadata))
    {
        uint32_t ack_status = NRF_SUCCESS;
#if MESH_FEATURE_LPN_ENABLED
        if (!is_in_friendship)
#endif
        {
            /* Release and ack regardless of whether upper layer succeeds */
            p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_PENDING;
            ack_status = sar_ack_send(&p_sar_ctx->metadata, p_sar_ctx->session.block_ack);
        }

        /* All packets have arrived */
        upper_transport_packet_in(p_sar_ctx->payload,
                                  p_sar_ctx->session.length,
                                  &p_sar_ctx->metadata,
                                  p_rx_metadata);

        if (ack_status == NRF_SUCCESS)
        {
            p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
            sar_ctx_rx_complete(p_sar_ctx);
        }
    }
}

static bool test_transport_decrypt(const nrf_mesh_application_secmat_t * p_app_security_material, ccm_soft_data_t * p_ccm_data)
{
    bool mic_passed = false;
    if (p_app_security_material != NULL)
    {
        p_ccm_data->p_key = p_app_security_material->key;
        enc_aes_ccm_decrypt(p_ccm_data, &mic_passed);
        if (mic_passed)
        {
            __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Message decrypted\n");
        }
    }
    return mic_passed;
}

static void upper_trs_packet_encrypt(const uint8_t * p_unencrypted_upper_trs_packet,
                                     uint8_t * p_encrypted_upper_trs_packet,
                                     uint32_t upper_trs_payload_len,
                                     const transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_unencrypted_upper_trs_packet != NULL);
    NRF_MESH_ASSERT(p_encrypted_upper_trs_packet != NULL);
    NRF_MESH_ASSERT(p_metadata != NULL);

    ccm_soft_data_t ccm_data;
    ccm_data.p_key = p_metadata->p_security_material->key;

    uint8_t app_nonce_buf[CCM_NONCE_LENGTH];
    enc_nonce_generate(&p_metadata->net,
                       (p_metadata->type.access.using_app_key ? ENC_NONCE_APP : ENC_NONCE_DEV),
                       (p_metadata->mic_size == PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE),
                       app_nonce_buf);

    ccm_data.p_nonce = app_nonce_buf;
    ccm_data.p_m     = p_unencrypted_upper_trs_packet;
    ccm_data.m_len   = upper_trs_payload_len;
    ccm_data.p_out   = p_encrypted_upper_trs_packet;
    ccm_data.p_mic   = (uint8_t *) ccm_data.p_out + ccm_data.m_len;
    ccm_data.mic_len = p_metadata->mic_size;

    if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        NRF_MESH_ASSERT(p_metadata->net.dst.p_virtual_uuid != NULL);
        ccm_data.p_a   = p_metadata->net.dst.p_virtual_uuid;
        ccm_data.a_len = NRF_MESH_KEY_SIZE;
    }
    else
    {
        ccm_data.a_len = 0;
    }

    enc_aes_ccm_encrypt(&ccm_data);
}

static uint8_t mic_size_decode(uint8_t encoded_mic_opt_val)
{
    return (encoded_mic_opt_val == NRF_MESH_TRANSMIC_SIZE_SMALL) ?
           PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE:
           PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE;
}

static uint32_t transport_metadata_from_tx_params(transport_packet_metadata_t * p_metadata,
                                              const nrf_mesh_tx_params_t * p_tx_params)
{
    p_metadata->type.access.app_key_id = p_tx_params->security_material.p_app->aid;
    p_metadata->type.access.using_app_key = (!p_tx_params->security_material.p_app->is_device_key);
    p_metadata->p_security_material = p_tx_params->security_material.p_app;
    p_metadata->mic_size = (p_tx_params->transmic_size == NRF_MESH_TRANSMIC_SIZE_DEFAULT) ?
                            mic_size_decode(m_trs_config.szmic) : mic_size_decode(p_tx_params->transmic_size);

    /* Check for a valid MIC size and resultant packet length combination. Large MIC size is not
    allowed for Unsegmented messages. See Table 3.42 of Mesh Profile Specification v1.0. */
    if (p_tx_params->force_segmented == false &&
       (p_tx_params->data_len <= (PACKET_MESH_TRS_UNSEG_ACCESS_PDU_MAX_SIZE - p_metadata->mic_size)) &&
       (p_metadata->mic_size == PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE))
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    p_metadata->segmented = ((p_tx_params->data_len > PACKET_MESH_TRS_UNSEG_ACCESS_PDU_MAX_SIZE - p_metadata->mic_size) ||
                             p_tx_params->force_segmented);

    if (p_metadata->segmented)
    {
        uint32_t num_segments = ((p_tx_params->data_len + p_metadata->mic_size +
                                  PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE - 1) /
                                 PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE);
        p_metadata->segmentation.last_segment = num_segments - 1;
        p_metadata->segmentation.segment_offset = 0;
    }

    p_metadata->net.control_packet = false;
    p_metadata->net.dst = p_tx_params->dst;
    p_metadata->net.p_security_material = p_tx_params->security_material.p_net;
    p_metadata->net.src = p_tx_params->src;
    p_metadata->net.ttl = p_tx_params->ttl;
    p_metadata->token = p_tx_params->tx_token;
    p_metadata->tx_bearer_selector = CORE_TX_BEARER_TYPE_ALLOW_ALL;

    return NRF_SUCCESS;
}

