NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    return status;
}

static uint32_t segmented_packet_tx(const transport_packet_metadata_t * p_metadata,
                                    const uint8_t * p_payload,
                                    uint32_t payload_len)
{
    uint32_t packet_length = payload_len + p_metadata->mic_size;
    if (packet_length > TRANSPORT_SAR_PACKET_MAX_SIZE(p_metadata->net.control_packet))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    /* According to the Mesh Profile Specification v1.0 Section 3.6.4.1, we should only ever send one
     * transport SAR packet at the same time between a given source and destination. Return FORBIDDEN if
     * there's a SAR session in progress with the same parameters. */
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX &&
            m_trs_sar_sessions[i].metadata.net.src == p_metadata->net.src &&
            m_trs_sar_sessions[i].metadata.net.dst.value == p_metadata->net.dst.value)
        {
            return NRF_ERROR_INVALID_STATE;
        }
    }

    trs_sar_ctx_t * p_sar_ctx = sar_ctx_alloc(p_metadata, TRS_SAR_SESSION_TX, packet_length);
    if (p_sar_ctx == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }

    memcpy(p_sar_ctx->payload, p_payload, payload_len);

    uint32_t sent_segments = 0;
    uint32_t status = trs_sar_packet_out(p_sar_ctx, &sent_segments);
    if (status == NRF_SUCCESS ||
        status == NRF_ERROR_NO_MEM)
    {
        /* For NRF_ERROR_NO_MEM we assume there will be more memory available on the next
         * TX_COMPLETE event. */
        if (sent_segments > 0)
        {
            tx_retry_timer_reset(p_sar_ctx);
        }

        __LOG_XB(LOG_SRC_TRANSPORT,
                 LOG_LEVEL_INFO,
                 "TX:SAR packet",
                 p_sar_ctx->payload,
                 p_sar_ctx->session.length);

        return NRF_SUCCESS;
    }
    else
    {
        sar_ctx_free(p_sar_ctx);
        return status;
    }
}


/** Process ongoing SAR TX sessions. */
static void trs_sar_tx_process(void)
{
    /* Loop through all active sessions and (re-)transmit remaining packets. */
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX)
        {
            uint32_t sent_segments = 0;
            uint32_t status = trs_sar_packet_out(&m_trs_sar_sessions[i], &sent_segments);

            /* Assume that there will be available memory on the next TX_COMPLETE event. */
            if (status == NRF_ERROR_NO_MEM || sent_segments != 0)
            {
                tx_retry_timer_reset(&m_trs_sar_sessions[i]);
            }
        }
    }
}

static void trs_sar_rx_pending_ack_send(trs_sar_ctx_t * p_sar_ctx)
{
    if (p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX &&
        p_sar_ctx->session.params.rx.ack_state == SAR_ACK_STATE_PENDING)
    {
        if (sar_ack_send(&p_sar_ctx->metadata, p_sar_ctx->session.block_ack) == NRF_SUCCESS)
        {
            p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
            if (p_sar_ctx->session.block_ack == block_ack_full(&p_sar_ctx->metadata))
            {
                sar_ctx_rx_complete(p_sar_ctx);
            }
        }
    }
}

static void trs_sar_rx_process(void)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        trs_sar_rx_pending_ack_send(&m_trs_sar_sessions[i]);
    }
}

static bool transport_sar_process(void)
{
    trs_sar_tx_process();
    trs_sar_rx_process();
    return true;
}

static uint32_t upper_trs_packet_decrypt(transport_packet_metadata_t * p_metadata,
                                         const uint8_t * p_upper_trs_packet,
                                         uint32_t upper_trs_packet_len,
                                         uint8_t * p_upper_trs_packet_out)
{
    /* Use seq_zero network sequence number if this is a segmented message */
    uint32_t old_network_seqnum = p_metadata->net.internal.sequence_number;
    if (p_metadata->segmented)
    {
        p_metadata->net.internal.sequence_number =
            seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                        p_metadata->segmentation.seq_zero);
    }
    /* Calculate nonce */
    uint8_t app_nonce_buf[CCM_NONCE_LENGTH];
    enc_nonce_generate(&p_metadata->net,
                       ((p_metadata->type.access.using_app_key) ? ENC_NONCE_APP : ENC_NONCE_DEV),
                       (p_metadata->mic_size == PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE),
                       app_nonce_buf);
    /* Reset the network sequence number to its original value, to keep a predictable state. */
    p_metadata->net.internal.sequence_number = old_network_seqnum;

    ccm_soft_data_t ccm_data;
    ccm_data.p_nonce = app_nonce_buf;
    ccm_data.p_m     = p_upper_trs_packet;
    ccm_data.m_len   = (upper_trs_packet_len - p_metadata->mic_size);
    ccm_data.p_mic   = (uint8_t *) ccm_data.p_m + ccm_data.m_len;
    ccm_data.p_out   = p_upper_trs_packet_out;
    ccm_data.mic_len = p_metadata->mic_size;
    ccm_data.a_len = 0;

    if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        ccm_data.a_len = NRF_MESH_UUID_SIZE;
    }

    if (p_metadata->type.access.using_app_key)
    {
        do {
            if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
            {
                ccm_data.p_a = p_metadata->net.dst.p_virtual_uuid;
            }

            /* Application key */
            p_metadata->p_security_material = NULL;
            for (nrf_mesh_app_secmat_next_get(p_metadata->net.p_security_material,
                                              p_metadata->type.access.app_key_id,
                                              &p_metadata->p_security_material);
                 p_metadata->p_security_material != NULL;
                 nrf_mesh_app_secmat_next_get(p_metadata->net.p_security_material,
                                              p_metadata->type.access.app_key_id,
                                              &p_metadata->p_security_material))
            {
                if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
                {
                    return NRF_SUCCESS;
                }
            }
        } while (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL &&
                 nrf_mesh_rx_address_get(p_metadata->net.dst.value, &p_metadata->net.dst));
    }
    else
    {
        /* Device key */
        p_metadata->p_security_material = NULL;
        if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
        {
            nrf_mesh_devkey_secmat_get(p_metadata->net.dst.value, &p_metadata->p_security_material);
            if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
            {
                return NRF_SUCCESS;
            }
        }

        /* try the src address */
        p_metadata->p_security_material = NULL;
        nrf_mesh_devkey_secmat_get(p_metadata->net.src, &p_metadata->p_security_material);
        if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
        {
            return NRF_SUCCESS;
        }
    }

    return NRF_ERROR_NOT_FOUND;
}

static void transport_metadata_build(const packet_mesh_trs_packet_t * p_transport_packet,
                                     const network_packet_metadata_t * p_net_metadata,
                                     const nrf_mesh_rx_metadata_t * p_rx_metadata,
                                     transport_packet_metadata_t * p_trs_metadata)
{
    memcpy(&p_trs_metadata->net, p_net_metadata, sizeof(network_packet_metadata_t));
    p_trs_metadata->segmented = packet_mesh_trs_common_seg_get(p_transport_packet);

    if (p_trs_metadata->net.control_packet)
    {
        p_trs_metadata->type.control.opcode = (transport_control_opcode_t) packet_mesh_trs_control_opcode_get(p_transport_packet);
        p_trs_metadata->mic_size = PACKET_MESH_TRS_TRANSMIC_CONTROL_SIZE;
    }
    else
    {
        p_trs_metadata->type.access.using_app_key = packet_mesh_trs_access_akf_get(p_transport_packet);
        p_trs_metadata->type.access.app_key_id = packet_mesh_trs_access_aid_get(p_transport_packet);
        if (p_trs_metadata->segmented)
        {
            p_trs_metadata->mic_size = ((packet_mesh_trs_seg_szmic_get(p_transport_packet)) ? PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE : PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE);
        }
        else
        {
            p_trs_metadata->mic_size = PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE;
        }
    }

    if (p_trs_metadata->segmented)
    {
        p_trs_metadata->segmentation.seq_zero       = packet_mesh_trs_seg_seqzero_get(p_transport_packet);
        p_trs_metadata->segmentation.segment_offset = packet_mesh_trs_seg_sego_get(p_transport_packet);
        p_trs_metadata->segmentation.last_segment   = packet_mesh_trs_seg_segn_get(p_transport_packet);
    }
    /* Not enough information to populate the secmat yet. */
    p_trs_metadata->p_security_material = NULL;

    /* Map RX source to the TX bearer we should use to send responses */
    static const core_tx_bearer_type_t rx_source_to_tx_bearer[] = {
        [NRF_MESH_RX_SOURCE_SCANNER]    = CORE_TX_BEARER_TYPE_ADV,
        [NRF_MESH_RX_SOURCE_GATT]       = CORE_TX_BEARER_TYPE_GATT_SERVER,
        [NRF_MESH_RX_SOURCE_FRIEND]     = CORE_TX_BEARER_TYPE_ADV,
        [NRF_MESH_RX_SOURCE_LOW_POWER]  = CORE_TX_BEARER_TYPE_FRIEND,
        [NRF_MESH_RX_SOURCE_INSTABURST] = CORE_TX_BEARER_TYPE_ADV,
        [NRF_MESH_RX_SOURCE_LOOPBACK]   = CORE_TX_BEARER_TYPE_INVALID,
    };
    NRF_MESH_ASSERT(p_rx_metadata->source < ARRAY_SIZE(rx_source_to_tx_bearer));
    p_trs_metadata->tx_bearer_selector = rx_source_to_tx_bearer[p_rx_metadata->source];
}

