NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    switch (id)
    {
        case NRF_MESH_OPT_TRS_SAR_RX_TIMEOUT:
            if (p_opt->opt.val < TRANSPORT_SAR_RX_TIMEOUT_MIN ||
                p_opt->opt.val > TRANSPORT_SAR_RX_TIMEOUT_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            m_trs_config.rx_timeout = p_opt->opt.val;
            break;

        case NRF_MESH_OPT_TRS_SAR_RX_ACK_TIMEOUT_BASE:
            if (p_opt->opt.val < TRANSPORT_SAR_RX_ACK_TIMEOUT_BASE_MIN ||
                p_opt->opt.val > TRANSPORT_SAR_RX_ACK_TIMEOUT_BASE_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            m_trs_config.rx_ack_base_timeout = p_opt->opt.val;
            break;

        case NRF_MESH_OPT_TRS_SAR_RX_ACK_TIMEOUT_PER_HOP_ADDITION:
            if (p_opt->opt.val < TRANSPORT_SAR_RX_ACK_TIMEOUT_PER_HOP_ADDITION_MIN ||
                p_opt->opt.val > TRANSPORT_SAR_RX_ACK_TIMEOUT_PER_HOP_ADDITION_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            m_trs_config.rx_ack_per_hop_addition = p_opt->opt.val;
            break;

        case NRF_MESH_OPT_TRS_SAR_TX_RETRY_TIMEOUT_BASE:
            if (p_opt->opt.val < TRANSPORT_SAR_TX_RETRY_TIMEOUT_BASE_MIN ||
                p_opt->opt.val > TRANSPORT_SAR_TX_RETRY_TIMEOUT_BASE_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            m_trs_config.tx_retry_base_timeout = p_opt->opt.val;
            break;

        case NRF_MESH_OPT_TRS_SAR_TX_RETRY_TIMEOUT_PER_HOP_ADDITION:
            if (p_opt->opt.val < TRANSPORT_SAR_TX_RETRY_TIMEOUT_PER_HOP_ADDITION_MIN ||
                p_opt->opt.val > TRANSPORT_SAR_TX_RETRY_TIMEOUT_PER_HOP_ADDITION_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            m_trs_config.tx_retry_per_hop_addition = p_opt->opt.val;
            break;

        case NRF_MESH_OPT_TRS_SAR_TX_RETRIES:
            if (p_opt->opt.val < TRANSPORT_SAR_TX_RETRIES_MIN ||
                p_opt->opt.val > TRANSPORT_SAR_TX_RETRIES_MAX)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            m_trs_config.tx_retries = (uint8_t) p_opt->opt.val;
            break;

        case NRF_MESH_OPT_TRS_SAR_SEGACK_TTL:
            if (p_opt->opt.val > NRF_MESH_TTL_MAX || p_opt->opt.val < 1)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            m_trs_config.segack_ttl = p_opt->opt.val;
            break;

        case NRF_MESH_OPT_TRS_SZMIC:
            if (p_opt->opt.val != NRF_MESH_TRANSMIC_SIZE_LARGE && p_opt->opt.val != NRF_MESH_TRANSMIC_SIZE_SMALL)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            m_trs_config.szmic = p_opt->opt.val;
            break;

        default:
            return NRF_ERROR_NOT_FOUND;
    }

    return NRF_SUCCESS;
}

uint32_t transport_opt_get(nrf_mesh_opt_id_t id, nrf_mesh_opt_t * const p_opt)
{
    if (!p_opt)
    {
        return NRF_ERROR_NULL;
    }

    memset(p_opt, 0, sizeof(nrf_mesh_opt_t));

    switch (id)
    {
        case NRF_MESH_OPT_TRS_SAR_RX_TIMEOUT:
            p_opt->opt.val = m_trs_config.rx_timeout;
            break;

        case NRF_MESH_OPT_TRS_SAR_RX_ACK_TIMEOUT_BASE:
            p_opt->opt.val = m_trs_config.rx_ack_base_timeout;
            break;
        case NRF_MESH_OPT_TRS_SAR_RX_ACK_TIMEOUT_PER_HOP_ADDITION:
            p_opt->opt.val = m_trs_config.rx_ack_per_hop_addition;
            break;

        case NRF_MESH_OPT_TRS_SAR_TX_RETRY_TIMEOUT_BASE:
            p_opt->opt.val = m_trs_config.tx_retry_base_timeout;
            break;
        case NRF_MESH_OPT_TRS_SAR_TX_RETRY_TIMEOUT_PER_HOP_ADDITION:
            p_opt->opt.val = m_trs_config.tx_retry_per_hop_addition;
            break;

        case NRF_MESH_OPT_TRS_SAR_TX_RETRIES:
            p_opt->opt.val = m_trs_config.tx_retries;
            break;

        case NRF_MESH_OPT_TRS_SAR_SEGACK_TTL:
            p_opt->opt.val = m_trs_config.segack_ttl;
            break;

        case NRF_MESH_OPT_TRS_SZMIC:
            p_opt->opt.val = m_trs_config.szmic;
            break;

        default:
            return NRF_ERROR_NOT_FOUND;
    }

    return NRF_SUCCESS;
}

uint32_t transport_control_packet_consumer_add(const transport_control_packet_handler_t * p_handlers, uint32_t handler_count)
{
    if (p_handlers == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (m_control_packet_consumer_count >= TRANSPORT_CONTROL_PACKET_CONSUMERS_MAX)
    {
        return NRF_ERROR_NO_MEM;
    }

    for (uint32_t i = 0; i < handler_count; ++i)
    {
        if (p_handlers[i].callback == NULL)
        {
            return NRF_ERROR_NULL;
        }
        if ((uint8_t) p_handlers[i].opcode > TRANSPORT_CONTROL_PACKET_OPCODE_MAX)
        {
            return NRF_ERROR_INVALID_DATA;
        }
        if (p_handlers[i].opcode == TRANSPORT_CONTROL_OPCODE_SEGACK ||
            control_packet_callback_get(p_handlers[i].opcode) != NULL)
        {
            /* duplicate */
            return NRF_ERROR_FORBIDDEN;
        }
    }

    m_control_packet_consumers[m_control_packet_consumer_count].p_handlers = p_handlers;
    m_control_packet_consumers[m_control_packet_consumer_count].handler_count = handler_count;
    m_control_packet_consumer_count++;
    return NRF_SUCCESS;
}
